app/controllers/response_controller.rb

  def create
    @survey = Survey.find_by_uuid(params[:uuid])
    @response = Response.new(
      title: params[:title],compensation: params[:compensation],
      experience: params[:experience], survey: @survey
    )
    @response.save
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."uuid" = ? LIMIT ?  [["uuid", "60024e37-8431-4697-a1fc-07b97bcad138"], ["LIMIT", 1]]
INSERT INTO "responses" ("title", "compensation", "experience", "survey_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "1"], ["compensation", 1], ["experience", 1], ["survey_id", 5], ["created_at", "2019-05-01 05:32:59.489957"], ["updated_at", "2019-05-01 05:32:59.489957"]]

  def index
    @survey = Survey.find_by_uuid(params[:uuid])
    @responses = Response.where(survey_id: @survey.id)
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."uuid" = ? LIMIT ?  [["uuid", "60024e37-8431-4697-a1fc-07b97bcad138"], ["LIMIT", 1]]
SELECT  "responses".* FROM "responses" WHERE "responses"."survey_id" = ? LIMIT ?  [["survey_id", 5], ["LIMIT", 1]]