app/controllers/survey_controller.rb

INSERT INTO "surveys" ("uuid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uuid", "a5790734-e8b9-49f3-b8c7-246cd1240a52"], ["name", "hello?"], ["created_at", "2019-05-01 04:42:48.941102"], ["updated_at", "2019-05-01 04:42:48.941102"]]
---
  def create
    print "we are creating survey"
    @survey = Survey.new(name: params[:name],uuid: params[:survey_id])
    @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."uuid" = ? LIMIT ?  [["uuid", "e9392653-e9a9-4627-9db0-fb638456cf12"], ["LIMIT", 1]]
---
  def show
    @survey = Survey.find_by_uuid(params[:uuid])